ХМНПФ_Общее/Documents/уп_ОтветНаЗапросВОПФР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ОтветНаЗапросВОПФР</Name>
		</Properties>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_СостоянияЗапросаВОПФР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостоянияЗапросаВОПФР</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Принят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Documents/уп_ОтветНаЗапросВОПФР/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
&ИзменениеИКонтроль("УстановитьВидимость")
Процедура ХМУстановитьВидимость()
	
	ЗагруженИзФайла = ЗначениеЗаполнено(Объект.ПакетЭД);
	
	Элементы.Выплаты.Видимость = Объект.РезультатОтвета = Перечисления.уп_СостоянияЗапросаВОПФР.Принят 
									И (Объект.Вариант = 0 Или Объект.Вариант = 1);
	Элементы.Выплаты_v2.Видимость = Объект.РезультатОтвета = Перечисления.уп_СостоянияЗапросаВОПФР.Принят И Объект.Вариант = 2;
	Элементы.Выплаты_v3.Видимость = Объект.РезультатОтвета = Перечисления.уп_СостоянияЗапросаВОПФР.Принят И Объект.Вариант = 3;
	Элементы.СписокЗапросовВОПФРПоСтарости.Видимость = Не Объект.Вариант = 3;
	Элементы.СписокЗапросовВОПФРПоСтарости1.Видимость = Не Объект.Вариант = 3; 
	Элементы.ПричиныОтказа.Видимость = Объект.РезультатОтвета = Перечисления.уп_СостоянияЗапросаВОПФР.Отказ;
	Элементы.РасшифровкаСуммЧФР.Видимость = Объект.РезультатОтвета = Перечисления.уп_СостоянияЗапросаВОПФР.Принят;
	Элементы.РасшифровкаСуммНеРазнесенныйИД.Видимость = Объект.РезультатОтвета = Перечисления.уп_СостоянияЗапросаВОПФР.Отказ;
	Элементы.Группа3.Видимость = ВводСписком; 
	Элементы.ГруппаВводСписком.Видимость = ВводСписком;
	Элементы.ГруппаВводСтрокой.Видимость = НЕ ВводСписком;
	#Удаление
	Элементы.СписокЗапросовВОПФРПолучательПенсииВПФР.Видимость = Объект.РезультатОтвета = Перечисления.уп_СостоянияЗапросаВОПФР.Принят;
	#КонецУдаления
	#Вставка
	// +ХМНПФ 10.02.2020 МилевскийАЮ // УстановитьВидимость() // №2666	
	#КонецВставки
	Элементы.Организация.ТолькоПросмотр = ЗагруженИзФайла;
	Элементы.РезультатОтвета.ТолькоПросмотр = ЗагруженИзФайла;
	#Удаление
	Элементы.СписокЗапросовВОПФРПолучательПенсииВПФР.Видимость = НЕ Объект.Вариант = 2;
	#КонецУдаления
	#Вставка
	// +ХМНПФ 10.02.2020 МилевскийАЮ // УстановитьВидимость() // №2666		
	#КонецВставки
	Элементы.СписокЗапросовВОПФРПоСтарости.Видимость = Объект.Вариант = 2;
	
	Элементы.ВводСписком.Доступность = НЕ Объект.СписокЗапросовВОПФР.Количество() > 1;
	
	Элементы.СписокЗапросовВОПФРПолучательПенсииВПФР1.Видимость = НЕ Объект.Вариант = 2;
	Элементы.СписокЗапросовВОПФРПоСтарости1.Видимость = Объект.Вариант = 2;
	
	Если Не ЗагруженИзФайла Тогда
		Элементы.Выплаты_v2.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Авто;
		Элементы.РасшифровкаСумм.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Авто;
		Элементы.ПричиныОтказа.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Авто;
	КонецЕсли;
	Элементы.Выплаты_v2.ИзменятьСоставСтрок = Не ЗагруженИзФайла;
	Элементы.ПричиныОтказа.ИзменятьСоставСтрок = Не ЗагруженИзФайла;
	Элементы.РасшифровкаСумм.ИзменятьСоставСтрок = Не ЗагруженИзФайла;
	
	Элементы.РасшифровкаСуммТипСуммы.ТолькоПросмотр = ЗагруженИзФайла;
	Элементы.РасшифровкаСуммСумма.ТолькоПросмотр = ЗагруженИзФайла;
	Элементы.РасшифровкаСуммИД.ТолькоПросмотр = ЗагруженИзФайла;
	Элементы.РасшифровкаСуммНеРазнесенныйИД.ТолькоПросмотр = ЗагруженИзФайла;
	Элементы.РасшифровкаСуммЧФР.ТолькоПросмотр = ЗагруженИзФайла;
	
	Элементы.ПричиныОтказаКод.ТолькоПросмотр = ЗагруженИзФайла;
	Элементы.ПричиныОтказаНаименование.ТолькоПросмотр = ЗагруженИзФайла;
	
КонецПроцедуры

Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 10.02.2020 МилевскийАЮ // Новая ХМ_ПриСозданииНаСервере() // №2666
	// ХМНПФ 10.02.2020 МилевскийАЮ // УстановитьВидимость() // №2666
	// изменнеия по задаче №2666 удалить после перехода на релиз 4.1.22.1
КонецПроцедуры

// ХМНПФ 10.02.2020 МилевскийАЮ // Новая ХМ_ПриСозданииНаСервере() // №2666
&НаСервере
Процедура ХМПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Элементы.СписокЗапросовВОПФРПолучательПенсииВПФР.Видимость = Ложь;	
	НовыйЭлемент = Элементы.Добавить("ПоСтарости", Тип("ПолеФормы"), Элементы.СписокЗапросовВОПФР); 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	НовыйЭлемент.Заголовок = "Есть право на страховую пенсию по старости";
	НовыйЭлемент.ПутьКДанным = "Объект.СписокЗапросовВОПФР.ПоСтарости";   
КонецПроцедуры
// -ХМНПФ 10.02.2020 МилевскийАЮ // Модуль // №2666
